dylad/RIOT/cpu/sam0_common/include/vendor/samd51/include/compat_samd51.h
#define CAN_TXBCIE_CFIE21_Msk (_U_(0x1) << CAN_TXBCIE_CFIE21_Pos)
#define CAN_TXBCIE_CFIE22_Msk (_U_(0x1) << CAN_TXBCIE_CFIE22_Pos)
#define CAN_TXBCIE_CFIE23_Msk (_U_(0x1) << CAN_TXBCIE_CFIE23_Pos)
#define CAN_TXBCIE_CFIE24_Msk (_U_(0x1) << CAN_TXBCIE_CFIE24_Pos)
#define CAN_TXBCIE_CFIE25_Msk (_U_(0x1) << CAN_TXBCIE_CFIE25_Pos)
#define CAN_TXBCIE_CFIE26_Msk (_U_(0x1) << CAN_TXBCIE_CFIE26_Pos)
#define CAN_TXBCIE_CFIE27_Msk (_U_(0x1) << CAN_TXBCIE_CFIE27_Pos)
#define CAN_TXBCIE_CFIE28_Msk (_U_(0x1) << CAN_TXBCIE_CFIE28_Pos)
#define CAN_TXBCIE_CFIE29_Msk (_U_(0x1) << CAN_TXBCIE_CFIE29_Pos)
#define CAN_TXBCIE_CFIE30_Msk (_U_(0x1) << CAN_TXBCIE_CFIE30_Pos)
#define CAN_TXBCIE_CFIE31_Msk (_U_(0x1) << CAN_TXBCIE_CFIE31_Pos)
#define CAN_TXEFS_EFF_Msk (_U_(0x1) << CAN_TXEFS_EFF_Pos)
#define CAN_TXEFS_TEFL_Msk (_U_(0x1) << CAN_TXEFS_TEFL_Pos)
#define CAN_RXBE_0_RTR_Msk (_U_(0x1) << CAN_RXBE_0_RTR_Pos)
#define CAN_RXBE_0_XTD_Msk (_U_(0x1) << CAN_RXBE_0_XTD_Pos)
#define CAN_RXBE_0_ESI_Msk (_U_(0x1) << CAN_RXBE_0_ESI_Pos)
#define CAN_RXBE_1_BRS_Msk (_U_(0x1) << CAN_RXBE_1_BRS_Pos)
#define CAN_RXBE_1_FDF_Msk (_U_(0x1) << CAN_RXBE_1_FDF_Pos)
#define CAN_RXBE_1_ANMF_Msk (_U_(0x1) << CAN_RXBE_1_ANMF_Pos)
#define CAN_RXF0E_0_RTR_Msk (_U_(0x1) << CAN_RXF0E_0_RTR_Pos)
#define CAN_RXF0E_0_XTD_Msk (_U_(0x1) << CAN_RXF0E_0_XTD_Pos)
#define CAN_RXF0E_0_ESI_Msk (_U_(0x1) << CAN_RXF0E_0_ESI_Pos)
#define CAN_RXF0E_1_BRS_Msk (_U_(0x1) << CAN_RXF0E_1_BRS_Pos)
#define CAN_RXF0E_1_FDF_Msk (_U_(0x1) << CAN_RXF0E_1_FDF_Pos)
#define CAN_RXF0E_1_ANMF_Msk (_U_(0x1) << CAN_RXF0E_1_ANMF_Pos)
#define CAN_RXF1E_0_RTR_Msk (_U_(0x1) << CAN_RXF1E_0_RTR_Pos)
#define CAN_RXF1E_0_XTD_Msk (_U_(0x1) << CAN_RXF1E_0_XTD_Pos)
#define CAN_RXF1E_0_ESI_Msk (_U_(0x1) << CAN_RXF1E_0_ESI_Pos)
#define CAN_RXF1E_1_BRS_Msk (_U_(0x1) << CAN_RXF1E_1_BRS_Pos)
#define CAN_RXF1E_1_FDF_Msk (_U_(0x1) << CAN_RXF1E_1_FDF_Pos)
#define CAN_RXF1E_1_ANMF_Msk (_U_(0x1) << CAN_RXF1E_1_ANMF_Pos)
#define CAN_TXBE_0_RTR_Msk (_U_(0x1) << CAN_TXBE_0_RTR_Pos)
#define CAN_TXBE_0_XTD_Msk (_U_(0x1) << CAN_TXBE_0_XTD_Pos)
#define CAN_TXBE_0_ESI_Msk (_U_(0x1) << CAN_TXBE_0_ESI_Pos)
#define CAN_TXBE_1_BRS_Msk (_U_(0x1) << CAN_TXBE_1_BRS_Pos)
#define CAN_TXBE_1_FDF_Msk (_U_(0x1) << CAN_TXBE_1_FDF_Pos)
#define CAN_TXBE_1_EFC_Msk (_U_(0x1) << CAN_TXBE_1_EFC_Pos)
#define CAN_TXEFE_0_RTR_Msk (_U_(0x1) << CAN_TXEFE_0_RTR_Pos)
#define CAN_TXEFE_0_XTD_Msk (_U_(0x1) << CAN_TXEFE_0_XTD_Pos)
#define CAN_TXEFE_0_ESI_Msk (_U_(0x1) << CAN_TXEFE_0_ESI_Pos)
#define CAN_TXEFE_1_BRS_Msk (_U_(0x1) << CAN_TXEFE_1_BRS_Pos)
#define CAN_TXEFE_1_FDF_Msk (_U_(0x1) << CAN_TXEFE_1_FDF_Pos)
#define CAN_CREL_Msk CAN_CREL_MASK
#define CAN_ENDN_Msk CAN_ENDN_MASK
#define CAN_MRCFG_Msk CAN_MRCFG_MASK
#define CAN_DBTP_Msk CAN_DBTP_MASK
#define CAN_TEST_Msk CAN_TEST_MASK
#define CAN_RWD_Msk CAN_RWD_MASK
#define CAN_CCCR_Msk CAN_CCCR_MASK
#define CAN_NBTP_Msk CAN_NBTP_MASK
#define CAN_TSCC_Msk CAN_TSCC_MASK
#define CAN_TSCV_Msk CAN_TSCV_MASK
#define CAN_TOCC_Msk CAN_TOCC_MASK
#define CAN_TOCV_Msk CAN_TOCV_MASK
#define CAN_ECR_Msk CAN_ECR_MASK
#define CAN_PSR_Msk CAN_PSR_MASK
#define CAN_TDCR_Msk CAN_TDCR_MASK
#define CAN_IR_Msk CAN_IR_MASK
#define CAN_IE_Msk CAN_IE_MASK
#define CAN_ILS_Msk CAN_ILS_MASK
#define CAN_ILE_Msk CAN_ILE_MASK
#define CAN_GFC_Msk CAN_GFC_MASK
#define CAN_SIDFC_Msk CAN_SIDFC_MASK
#define CAN_XIDFC_Msk CAN_XIDFC_MASK
#define CAN_XIDAM_Msk CAN_XIDAM_MASK
#define CAN_HPMS_Msk CAN_HPMS_MASK
#define CAN_NDAT1_Msk CAN_NDAT1_MASK
#define CAN_NDAT2_Msk CAN_NDAT2_MASK
#define CAN_RXF0C_Msk CAN_RXF0C_MASK
#define CAN_RXF0S_Msk CAN_RXF0S_MASK
#define CAN_RXF0A_Msk CAN_RXF0A_MASK
#define CAN_RXBC_Msk CAN_RXBC_MASK
#define CAN_RXF1C_Msk CAN_RXF1C_MASK
#define CAN_RXF1S_Msk CAN_RXF1S_MASK
#define CAN_RXF1A_Msk CAN_RXF1A_MASK
#define CAN_RXESC_Msk CAN_RXESC_MASK
#define CAN_TXBC_Msk CAN_TXBC_MASK
#define CAN_TXFQS_Msk CAN_TXFQS_MASK
#define CAN_TXESC_Msk CAN_TXESC_MASK
#define CAN_TXBRP_Msk CAN_TXBRP_MASK
#define CAN_TXBAR_Msk CAN_TXBAR_MASK
#define CAN_TXBCR_Msk CAN_TXBCR_MASK
#define CAN_TXBTO_Msk CAN_TXBTO_MASK
#define CAN_TXBCF_Msk CAN_TXBCF_MASK
#define CAN_TXBTIE_Msk CAN_TXBTIE_MASK
#define CAN_TXBCIE_Msk CAN_TXBCIE_MASK
#define CAN_TXEFC_Msk CAN_TXEFC_MASK
#define CAN_TXEFS_Msk CAN_TXEFS_MASK
#define CAN_TXEFA_Msk CAN_TXEFA_MASK
#define CAN_RXBE_0_Msk CAN_RXBE_0_MASK
#define CAN_RXBE_1_Msk CAN_RXBE_1_MASK
#define CAN_RXBE_DATA_Msk CAN_RXBE_DATA_MASK
#define CAN_RXF0E_0_Msk CAN_RXF0E_0_MASK
#define CAN_RXF0E_1_Msk CAN_RXF0E_1_MASK
#define CAN_RXF0E_DATA_Msk CAN_RXF0E_DATA_MASK
#define CAN_RXF1E_0_Msk CAN_RXF1E_0_MASK
#define CAN_RXF1E_1_Msk CAN_RXF1E_1_MASK
#define CAN_RXF1E_DATA_Msk CAN_RXF1E_DATA_MASK
#define CAN_SIDFE_0_Msk CAN_SIDFE_0_MASK
#define CAN_TXBE_0_Msk CAN_TXBE_0_MASK
#define CAN_TXBE_1_Msk CAN_TXBE_1_MASK
#define CAN_TXBE_DATA_Msk CAN_TXBE_DATA_MASK
#define CAN_TXEFE_0_Msk CAN_TXEFE_0_MASK
#define CAN_TXEFE_1_Msk CAN_TXEFE_1_MASK
#define CAN_XIDFE_0_Msk CAN_XIDFE_0_MASK
#define CAN_XIDFE_1_Msk CAN_XIDFE_1_MASK
#define CCL_CTRL_SWRST_Msk (_U_(0x1) << CCL_CTRL_SWRST_Pos)
#define CCL_CTRL_ENABLE_Msk (_U_(0x1) << CCL_CTRL_ENABLE_Pos)
#define CCL_CTRL_RUNSTDBY_Msk (_U_(0x1) << CCL_CTRL_RUNSTDBY_Pos)
#define CCL_LUTCTRL_ENABLE_Msk (_U_(0x1) << CCL_LUTCTRL_ENABLE_Pos)
#define CCL_LUTCTRL_EDGESEL_Msk (_U_(0x1) << CCL_LUTCTRL_EDGESEL_Pos)
#define CCL_LUTCTRL_INVEI_Msk (_U_(0x1) << CCL_LUTCTRL_INVEI_Pos)
#define CCL_LUTCTRL_LUTEI_Msk (_U_(0x1) << CCL_LUTCTRL_LUTEI_Pos)
#define CCL_LUTCTRL_LUTEO_Msk (_U_(0x1) << CCL_LUTCTRL_LUTEO_Pos)
#define CCL_CTRL_Msk CCL_CTRL_MASK
#define CCL_SEQCTRL_Msk CCL_SEQCTRL_MASK
#define CCL_LUTCTRL_INSEL0_Msk CCL_LUTCTRL_INSEL0_MASK
#define CCL_LUTCTRL_INSEL1_Msk CCL_LUTCTRL_INSEL1_MASK
#define CCL_LUTCTRL_INSEL2_Msk CCL_LUTCTRL_INSEL2_MASK
#define CCL_LUTCTRL_Msk CCL_LUTCTRL_MASK
#define CMCC_TYPE_GCLK_Msk (_U_(0x1) << CMCC_TYPE_GCLK_Pos)
#define CMCC_TYPE_RRP_Msk (_U_(0x1) << CMCC_TYPE_RRP_Pos)
#define CMCC_TYPE_LCKDOWN_Msk (_U_(0x1) << CMCC_TYPE_LCKDOWN_Pos)
#define CMCC_CFG_ICDIS_Msk (_U_(0x1) << CMCC_CFG_ICDIS_Pos)
#define CMCC_CFG_DCDIS_Msk (_U_(0x1) << CMCC_CFG_DCDIS_Pos)
#define CMCC_CTRL_CEN_Msk (_U_(0x1) << CMCC_CTRL_CEN_Pos)
#define CMCC_SR_CSTS_Msk (_U_(0x1) << CMCC_SR_CSTS_Pos)
#define CMCC_MAINT0_INVALL_Msk (_U_(0x1) << CMCC_MAINT0_INVALL_Pos)
#define CMCC_MEN_MENABLE_Msk (_U_(0x1) << CMCC_MEN_MENABLE_Pos)
#define CMCC_MCTRL_SWRST_Msk (_U_(0x1) << CMCC_MCTRL_SWRST_Pos)
#define CMCC_TYPE_Msk CMCC_TYPE_MASK
#define CMCC_CFG_Msk CMCC_CFG_MASK
#define CMCC_CTRL_Msk CMCC_CTRL_MASK
#define CMCC_SR_Msk CMCC_SR_MASK
#define CMCC_LCKWAY_Msk CMCC_LCKWAY_MASK
#define CMCC_MAINT0_Msk CMCC_MAINT0_MASK
#define CMCC_MAINT1_Msk CMCC_MAINT1_MASK
#define CMCC_MCFG_Msk CMCC_MCFG_MASK
#define CMCC_MEN_Msk CMCC_MEN_MASK
#define CMCC_MCTRL_Msk CMCC_MCTRL_MASK
#define CMCC_MSR_Msk CMCC_MSR_MASK
#define DAC_CTRLA_SWRST_Msk (_U_(0x1) << DAC_CTRLA_SWRST_Pos)
#define DAC_CTRLA_ENABLE_Msk (_U_(0x1) << DAC_CTRLA_ENABLE_Pos)
#define DAC_CTRLB_DIFF_Msk (_U_(0x1) << DAC_CTRLB_DIFF_Pos)
#define DAC_EVCTRL_STARTEI0_Msk (_U_(0x1) << DAC_EVCTRL_STARTEI0_Pos)
#define DAC_EVCTRL_STARTEI1_Msk (_U_(0x1) << DAC_EVCTRL_STARTEI1_Pos)
#define DAC_EVCTRL_EMPTYEO0_Msk (_U_(0x1) << DAC_EVCTRL_EMPTYEO0_Pos)
#define DAC_EVCTRL_EMPTYEO1_Msk (_U_(0x1) << DAC_EVCTRL_EMPTYEO1_Pos)
#define DAC_EVCTRL_INVEI0_Msk (_U_(0x1) << DAC_EVCTRL_INVEI0_Pos)
#define DAC_EVCTRL_INVEI1_Msk (_U_(0x1) << DAC_EVCTRL_INVEI1_Pos)
#define DAC_EVCTRL_RESRDYEO0_Msk (_U_(0x1) << DAC_EVCTRL_RESRDYEO0_Pos)
#define DAC_EVCTRL_RESRDYEO1_Msk (_U_(0x1) << DAC_EVCTRL_RESRDYEO1_Pos)
#define DAC_INTENCLR_UNDERRUN0_Msk (_U_(0x1) << DAC_INTENCLR_UNDERRUN0_Pos)
#define DAC_INTENCLR_UNDERRUN1_Msk (_U_(0x1) << DAC_INTENCLR_UNDERRUN1_Pos)
#define DAC_INTENCLR_EMPTY0_Msk (_U_(0x1) << DAC_INTENCLR_EMPTY0_Pos)
#define DAC_INTENCLR_EMPTY1_Msk (_U_(0x1) << DAC_INTENCLR_EMPTY1_Pos)
#define DAC_INTENCLR_RESRDY0_Msk (_U_(0x1) << DAC_INTENCLR_RESRDY0_Pos)
#define DAC_INTENCLR_RESRDY1_Msk (_U_(0x1) << DAC_INTENCLR_RESRDY1_Pos)
#define DAC_INTENCLR_OVERRUN0_Msk (_U_(0x1) << DAC_INTENCLR_OVERRUN0_Pos)
#define DAC_INTENCLR_OVERRUN1_Msk (_U_(0x1) << DAC_INTENCLR_OVERRUN1_Pos)
#define DAC_INTENSET_UNDERRUN0_Msk (_U_(0x1) << DAC_INTENSET_UNDERRUN0_Pos)
#define DAC_INTENSET_UNDERRUN1_Msk (_U_(0x1) << DAC_INTENSET_UNDERRUN1_Pos)
#define DAC_INTENSET_EMPTY0_Msk (_U_(0x1) << DAC_INTENSET_EMPTY0_Pos)
#define DAC_INTENSET_EMPTY1_Msk (_U_(0x1) << DAC_INTENSET_EMPTY1_Pos)
#define DAC_INTENSET_RESRDY0_Msk (_U_(0x1) << DAC_INTENSET_RESRDY0_Pos)
#define DAC_INTENSET_RESRDY1_Msk (_U_(0x1) << DAC_INTENSET_RESRDY1_Pos)
#define DAC_INTENSET_OVERRUN0_Msk (_U_(0x1) << DAC_INTENSET_OVERRUN0_Pos)
#define DAC_INTENSET_OVERRUN1_Msk (_U_(0x1) << DAC_INTENSET_OVERRUN1_Pos)
#define DAC_INTFLAG_UNDERRUN0_Msk (_U_(0x1) << DAC_INTFLAG_UNDERRUN0_Pos)
#define DAC_INTFLAG_UNDERRUN1_Msk (_U_(0x1) << DAC_INTFLAG_UNDERRUN1_Pos)
#define DAC_INTFLAG_EMPTY0_Msk (_U_(0x1) << DAC_INTFLAG_EMPTY0_Pos)
#define DAC_INTFLAG_EMPTY1_Msk (_U_(0x1) << DAC_INTFLAG_EMPTY1_Pos)
#define DAC_INTFLAG_RESRDY0_Msk (_U_(0x1) << DAC_INTFLAG_RESRDY0_Pos)
#define DAC_INTFLAG_RESRDY1_Msk (_U_(0x1) << DAC_INTFLAG_RESRDY1_Pos)
#define DAC_INTFLAG_OVERRUN0_Msk (_U_(0x1) << DAC_INTFLAG_OVERRUN0_Pos)
#define DAC_INTFLAG_OVERRUN1_Msk (_U_(0x1) << DAC_INTFLAG_OVERRUN1_Pos)
#define DAC_STATUS_READY0_Msk (_U_(0x1) << DAC_STATUS_READY0_Pos)
#define DAC_STATUS_READY1_Msk (_U_(0x1) << DAC_STATUS_READY1_Pos)
#define DAC_STATUS_EOC0_Msk (_U_(0x1) << DAC_STATUS_EOC0_Pos)
#define DAC_STATUS_EOC1_Msk (_U_(0x1) << DAC_STATUS_EOC1_Pos)
#define DAC_SYNCBUSY_SWRST_Msk (_U_(0x1) << DAC_SYNCBUSY_SWRST_Pos)
#define DAC_SYNCBUSY_ENABLE_Msk (_U_(0x1) << DAC_SYNCBUSY_ENABLE_Pos)
#define DAC_SYNCBUSY_DATA0_Msk (_U_(0x1) << DAC_SYNCBUSY_DATA0_Pos)
#define DAC_SYNCBUSY_DATA1_Msk (_U_(0x1) << DAC_SYNCBUSY_DATA1_Pos)
#define DAC_SYNCBUSY_DATABUF0_Msk (_U_(0x1) << DAC_SYNCBUSY_DATABUF0_Pos)
#define DAC_SYNCBUSY_DATABUF1_Msk (_U_(0x1) << DAC_SYNCBUSY_DATABUF1_Pos)
#define DAC_DACCTRL_LEFTADJ_Msk (_U_(0x1) << DAC_DACCTRL_LEFTADJ_Pos)
#define DAC_DACCTRL_ENABLE_Msk (_U_(0x1) << DAC_DACCTRL_ENABLE_Pos)
#define DAC_DACCTRL_FEXT_Msk (_U_(0x1) << DAC_DACCTRL_FEXT_Pos)
#define DAC_DACCTRL_RUNSTDBY_Msk (_U_(0x1) << DAC_DACCTRL_RUNSTDBY_Pos)
#define DAC_DACCTRL_DITHER_Msk (_U_(0x1) << DAC_DACCTRL_DITHER_Pos)
#define DAC_DBGCTRL_DBGRUN_Msk (_U_(0x1) << DAC_DBGCTRL_DBGRUN_Pos)
#define DAC_CTRLA_Msk DAC_CTRLA_MASK
#define DAC_CTRLB_Msk DAC_CTRLB_MASK
#define DAC_EVCTRL_Msk DAC_EVCTRL_MASK
#define DAC_INTENCLR_Msk DAC_INTENCLR_MASK
#define DAC_INTENSET_Msk DAC_INTENSET_MASK
#define DAC_INTFLAG_Msk DAC_INTFLAG_MASK
#define DAC_STATUS_Msk DAC_STATUS_MASK
#define DAC_SYNCBUSY_Msk DAC_SYNCBUSY_MASK
#define DAC_DACCTRL_Msk DAC_DACCTRL_MASK
#define DAC_DATA_Msk DAC_DATA_MASK
#define DAC_DATABUF_Msk DAC_DATABUF_MASK
#define DAC_DBGCTRL_Msk DAC_DBGCTRL_MASK
#define DAC_RESULT_Msk DAC_RESULT_MASK
#define DSU_CTRL_SWRST_Msk (_U_(0x1) << DSU_CTRL_SWRST_Pos)
#define DSU_CTRL_CRC_Msk (_U_(0x1) << DSU_CTRL_CRC_Pos)
#define DSU_CTRL_MBIST_Msk (_U_(0x1) << DSU_CTRL_MBIST_Pos)
#define DSU_CTRL_CE_Msk (_U_(0x1) << DSU_CTRL_CE_Pos)
#define DSU_CTRL_ARR_Msk (_U_(0x1) << DSU_CTRL_ARR_Pos)
#define DSU_CTRL_SMSA_Msk (_U_(0x1) << DSU_CTRL_SMSA_Pos)
#define DSU_STATUSA_DONE_Msk (_U_(0x1) << DSU_STATUSA_DONE_Pos)
#define DSU_STATUSA_CRSTEXT_Msk (_U_(0x1) << DSU_STATUSA_CRSTEXT_Pos)
#define DSU_STATUSA_BERR_Msk (_U_(0x1) << DSU_STATUSA_BERR_Pos)
#define DSU_STATUSA_FAIL_Msk (_U_(0x1) << DSU_STATUSA_FAIL_Pos)
#define DSU_STATUSA_PERR_Msk (_U_(0x1) << DSU_STATUSA_PERR_Pos)
#define DSU_STATUSB_PROT_Msk (_U_(0x1) << DSU_STATUSB_PROT_Pos)
#define DSU_STATUSB_DBGPRES_Msk (_U_(0x1) << DSU_STATUSB_DBGPRES_Pos)
#define DSU_STATUSB_DCCD0_Msk (_U_(0x1) << DSU_STATUSB_DCCD0_Pos)
#define DSU_STATUSB_DCCD1_Msk (_U_(0x1) << DSU_STATUSB_DCCD1_Pos)
#define DSU_STATUSB_HPE_Msk (_U_(0x1) << DSU_STATUSB_HPE_Pos)
#define DSU_STATUSB_CELCK_Msk (_U_(0x1) << DSU_STATUSB_CELCK_Pos)
#define DSU_STATUSB_TDCCD0_Msk (_U_(0x1) << DSU_STATUSB_TDCCD0_Pos)
#define DSU_STATUSB_TDCCD1_Msk (_U_(0x1) << DSU_STATUSB_TDCCD1_Pos)
#define DSU_CFG_ETBRAMEN_Msk (_U_(0x1) << DSU_CFG_ETBRAMEN_Pos)
#define DSU_ENTRY0_EPRES_Msk (_U_(0x1) << DSU_ENTRY0_EPRES_Pos)
#define DSU_ENTRY0_FMT_Msk (_U_(0x1) << DSU_ENTRY0_FMT_Pos)
#define DSU_MEMTYPE_SMEMP_Msk (_U_(0x1) << DSU_MEMTYPE_SMEMP_Pos)
#define DSU_PID2_JEPU_Msk (_U_(0x1) << DSU_PID2_JEPU_Pos)
#define DSU_CTRL_Msk DSU_CTRL_MASK
#define DSU_STATUSA_Msk DSU_STATUSA_MASK
#define DSU_STATUSB_Msk DSU_STATUSB_MASK
#define DSU_ADDR_Msk DSU_ADDR_MASK
#define DSU_LENGTH_Msk DSU_LENGTH_MASK
#define DSU_DATA_Msk DSU_DATA_MASK
#define DSU_DCC_Msk DSU_DCC_MASK
#define DSU_DID_Msk DSU_DID_MASK
#define DSU_CFG_Msk DSU_CFG_MASK
#define DSU_DCFG_Msk DSU_DCFG_MASK
#define DSU_ENTRY0_Msk DSU_ENTRY0_MASK
#define DSU_ENTRY1_Msk DSU_ENTRY1_MASK
#define DSU_END_Msk DSU_END_MASK
#define DSU_MEMTYPE_Msk DSU_MEMTYPE_MASK
#define DSU_PID4_Msk DSU_PID4_MASK
#define DSU_PID5_Msk DSU_PID5_MASK
#define DSU_PID6_Msk DSU_PID6_MASK
#define DSU_PID7_Msk DSU_PID7_MASK
#define DSU_PID0_Msk DSU_PID0_MASK
#define DSU_PID1_Msk DSU_PID1_MASK
#define DSU_PID2_Msk DSU_PID2_MASK
#define DSU_PID3_Msk DSU_PID3_MASK
#define DSU_CID0_Msk DSU_CID0_MASK
#define DSU_CID1_Msk DSU_CID1_MASK
#define DSU_CID2_Msk DSU_CID2_MASK
#define DSU_CID3_Msk DSU_CID3_MASK
#define GCLK_CTRLA_SWRST_Msk (_U_(0x1) << GCLK_CTRLA_SWRST_Pos)
#define GCLK_SYNCBUSY_SWRST_Msk (_U_(0x1) << GCLK_SYNCBUSY_SWRST_Pos)
#define GCLK_SYNCBUSY_GENCTRL0_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL0_Pos)
#define GCLK_SYNCBUSY_GENCTRL1_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL1_Pos)
#define GCLK_SYNCBUSY_GENCTRL2_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL2_Pos)
#define GCLK_SYNCBUSY_GENCTRL3_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL3_Pos)
#define GCLK_SYNCBUSY_GENCTRL4_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL4_Pos)
#define GCLK_SYNCBUSY_GENCTRL5_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL5_Pos)
#define GCLK_SYNCBUSY_GENCTRL6_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL6_Pos)
#define GCLK_SYNCBUSY_GENCTRL7_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL7_Pos)
#define GCLK_SYNCBUSY_GENCTRL8_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL8_Pos)
#define GCLK_SYNCBUSY_GENCTRL9_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL9_Pos)
#define GCLK_SYNCBUSY_GENCTRL10_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL10_Pos)
#define GCLK_SYNCBUSY_GENCTRL11_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL11_Pos)
#define GCLK_GENCTRL_GENEN_Msk (_U_(0x1) << GCLK_GENCTRL_GENEN_Pos)
#define GCLK_GENCTRL_IDC_Msk (_U_(0x1) << GCLK_GENCTRL_IDC_Pos)
#define GCLK_GENCTRL_OOV_Msk (_U_(0x1) << GCLK_GENCTRL_OOV_Pos)
#define GCLK_GENCTRL_OE_Msk (_U_(0x1) << GCLK_GENCTRL_OE_Pos)
#define GCLK_GENCTRL_DIVSEL_Msk (_U_(0x1) << GCLK_GENCTRL_DIVSEL_Pos)
#define GCLK_GENCTRL_RUNSTDBY_Msk (_U_(0x1) << GCLK_GENCTRL_RUNSTDBY_Pos)
#define GCLK_PCHCTRL_CHEN_Msk (_U_(0x1) << GCLK_PCHCTRL_CHEN_Pos)
#define GCLK_PCHCTRL_WRTLOCK_Msk (_U_(0x1) << GCLK_PCHCTRL_WRTLOCK_Pos)
#define GCLK_CTRLA_Msk GCLK_CTRLA_MASK
#define GCLK_SYNCBUSY_Msk GCLK_SYNCBUSY_MASK
#define GCLK_GENCTRL_Msk GCLK_GENCTRL_MASK
#define GCLK_PCHCTRL_Msk GCLK_PCHCTRL_MASK
#define HMATRIXB_PRAS_Msk HMATRIXB_PRAS_MASK
#define HMATRIXB_PRBS_Msk HMATRIXB_PRBS_MASK
#define ICM_CFG_WBDIS_Msk (_U_(0x1) << ICM_CFG_WBDIS_Pos)
#define ICM_CFG_EOMDIS_Msk (_U_(0x1) << ICM_CFG_EOMDIS_Pos)
#define ICM_CFG_SLBDIS_Msk (_U_(0x1) << ICM_CFG_SLBDIS_Pos)
#define ICM_CFG_ASCD_Msk (_U_(0x1) << ICM_CFG_ASCD_Pos)
#define ICM_CFG_DUALBUFF_Msk (_U_(0x1) << ICM_CFG_DUALBUFF_Pos)
#define ICM_CFG_UIHASH_Msk (_U_(0x1) << ICM_CFG_UIHASH_Pos)
#define ICM_CTRL_ENABLE_Msk (_U_(0x1) << ICM_CTRL_ENABLE_Pos)
#define ICM_CTRL_DISABLE_Msk (_U_(0x1) << ICM_CTRL_DISABLE_Pos)
#define ICM_CTRL_SWRST_Msk (_U_(0x1) << ICM_CTRL_SWRST_Pos)
#define ICM_SR_ENABLE_Msk (_U_(0x1) << ICM_SR_ENABLE_Pos)
#define ICM_IER_URAD_Msk (_U_(0x1) << ICM_IER_URAD_Pos)
#define ICM_IDR_URAD_Msk (_U_(0x1) << ICM_IDR_URAD_Pos)
#define ICM_IMR_URAD_Msk (_U_(0x1) << ICM_IMR_URAD_Pos)
#define ICM_ISR_URAD_Msk (_U_(0x1) << ICM_ISR_URAD_Pos)
#define ICM_RCFG_CDWBN_Msk (_U_(0x1) << ICM_RCFG_CDWBN_Pos)
#define ICM_RCFG_WRAP_Msk (_U_(0x1) << ICM_RCFG_WRAP_Pos)
#define ICM_RCFG_EOM_Msk (_U_(0x1) << ICM_RCFG_EOM_Pos)
#define ICM_RCFG_RHIEN_Msk (_U_(0x1) << ICM_RCFG_RHIEN_Pos)
#define ICM_RCFG_DMIEN_Msk (_U_(0x1) << ICM_RCFG_DMIEN_Pos)
#define ICM_RCFG_BEIEN_Msk (_U_(0x1) << ICM_RCFG_BEIEN_Pos)
#define ICM_RCFG_WCIEN_Msk (_U_(0x1) << ICM_RCFG_WCIEN_Pos)
#define ICM_RCFG_ECIEN_Msk (_U_(0x1) << ICM_RCFG_ECIEN_Pos)
#define ICM_RCFG_SUIEN_Msk (_U_(0x1) << ICM_RCFG_SUIEN_Pos)
#define ICM_RCFG_PROCDLY_Msk (_U_(0x1) << ICM_RCFG_PROCDLY_Pos)
#define ICM_CFG_Msk ICM_CFG_MASK
#define ICM_CTRL_Msk ICM_CTRL_MASK
#define ICM_SR_Msk ICM_SR_MASK
#define ICM_IER_Msk ICM_IER_MASK
#define ICM_IDR_Msk ICM_IDR_MASK
#define ICM_IMR_Msk ICM_IMR_MASK
#define ICM_ISR_Msk ICM_ISR_MASK
#define ICM_UASR_Msk ICM_UASR_MASK
#define ICM_DSCR_Msk ICM_DSCR_MASK
#define ICM_HASH_Msk ICM_HASH_MASK
#define ICM_UIHVAL_Msk ICM_UIHVAL_MASK
#define ICM_RADDR_Msk ICM_RADDR_MASK
#define ICM_RCFG_Msk ICM_RCFG_MASK
#define ICM_RCTRL_Msk ICM_RCTRL_MASK
#define ICM_RNEXT_Msk ICM_RNEXT_MASK
#define PCC_MR_PCEN_Msk (_U_(0x1) << PCC_MR_PCEN_Pos)
#define PCC_MR_SCALE_Msk (_U_(0x1) << PCC_MR_SCALE_Pos)
#define PCC_MR_ALWYS_Msk (_U_(0x1) << PCC_MR_ALWYS_Pos)
#define PCC_MR_HALFS_Msk (_U_(0x1) << PCC_MR_HALFS_Pos)
#define PCC_MR_FRSTS_Msk (_U_(0x1) << PCC_MR_FRSTS_Pos)
#define PCC_IER_DRDY_Msk (_U_(0x1) << PCC_IER_DRDY_Pos)
#define PCC_IER_OVRE_Msk (_U_(0x1) << PCC_IER_OVRE_Pos)
#define PCC_IDR_DRDY_Msk (_U_(0x1) << PCC_IDR_DRDY_Pos)
#define PCC_IDR_OVRE_Msk (_U_(0x1) << PCC_IDR_OVRE_Pos)
#define PCC_IMR_DRDY_Msk (_U_(0x1) << PCC_IMR_DRDY_Pos)
#define PCC_IMR_OVRE_Msk (_U_(0x1) << PCC_IMR_OVRE_Pos)
#define PCC_ISR_DRDY_Msk (_U_(0x1) << PCC_ISR_DRDY_Pos)
#define PCC_ISR_OVRE_Msk (_U_(0x1) << PCC_ISR_OVRE_Pos)
#define PCC_WPMR_WPEN_Msk (_U_(0x1) << PCC_WPMR_WPEN_Pos)
#define PCC_WPSR_WPVS_Msk (_U_(0x1) << PCC_WPSR_WPVS_Pos)
#define PCC_MR_Msk PCC_MR_MASK
#define PCC_IER_Msk PCC_IER_MASK
#define PCC_IDR_Msk PCC_IDR_MASK
#define PCC_IMR_Msk PCC_IMR_MASK
#define PCC_ISR_Msk PCC_ISR_MASK
#define PCC_RHR_Msk PCC_RHR_MASK
#define PCC_WPMR_Msk PCC_WPMR_MASK
#define PCC_WPSR_Msk PCC_WPSR_MASK
#define PORT_WRCONFIG_PMUXEN_Msk (_U_(0x1) << PORT_WRCONFIG_PMUXEN_Pos)
#define PORT_WRCONFIG_INEN_Msk (_U_(0x1) << PORT_WRCONFIG_INEN_Pos)
#define PORT_WRCONFIG_PULLEN_Msk (_U_(0x1) << PORT_WRCONFIG_PULLEN_Pos)
#define PORT_WRCONFIG_DRVSTR_Msk (_U_(0x1) << PORT_WRCONFIG_DRVSTR_Pos)
#define PORT_WRCONFIG_WRPMUX_Msk (_U_(0x1) << PORT_WRCONFIG_WRPMUX_Pos)
#define PORT_WRCONFIG_WRPINCFG_Msk (_U_(0x1) << PORT_WRCONFIG_WRPINCFG_Pos)
#define PORT_WRCONFIG_HWSEL_Msk (_U_(0x1) << PORT_WRCONFIG_HWSEL_Pos)
#define PORT_EVCTRL_PORTEI0_Msk (_U_(0x1) << PORT_EVCTRL_PORTEI0_Pos)
#define PORT_EVCTRL_PORTEI1_Msk (_U_(0x1) << PORT_EVCTRL_PORTEI1_Pos)
#define PORT_EVCTRL_PORTEI2_Msk (_U_(0x1) << PORT_EVCTRL_PORTEI2_Pos)
#define PORT_EVCTRL_PORTEI3_Msk (_U_(0x1) << PORT_EVCTRL_PORTEI3_Pos)
#define PORT_PINCFG_PMUXEN_Msk (_U_(0x1) << PORT_PINCFG_PMUXEN_Pos)
#define PORT_PINCFG_INEN_Msk (_U_(0x1) << PORT_PINCFG_INEN_Pos)
#define PORT_PINCFG_PULLEN_Msk (_U_(0x1) << PORT_PINCFG_PULLEN_Pos)
#define PORT_PINCFG_DRVSTR_Msk (_U_(0x1) << PORT_PINCFG_DRVSTR_Pos)
#define PORT_DIR_Msk PORT_DIR_MASK
#define PORT_DIRCLR_Msk PORT_DIRCLR_MASK
#define PORT_DIRSET_Msk PORT_DIRSET_MASK
#define PORT_DIRTGL_Msk PORT_DIRTGL_MASK
#define PORT_OUT_Msk PORT_OUT_MASK
#define PORT_OUTCLR_Msk PORT_OUTCLR_MASK
#define PORT_OUTSET_Msk PORT_OUTSET_MASK
#define PORT_OUTTGL_Msk PORT_OUTTGL_MASK
#define PORT_IN_Msk PORT_IN_MASK
#define PORT_CTRL_Msk PORT_CTRL_MASK
#define PORT_WRCONFIG_Msk PORT_WRCONFIG_MASK
#define PORT_EVCTRL_Msk PORT_EVCTRL_MASK
#define PORT_PMUX_Msk PORT_PMUX_MASK
#define PORT_PINCFG_Msk PORT_PINCFG_MASK
#define RSTC_RCAUSE_POR_Msk (_U_(0x1) << RSTC_RCAUSE_POR_Pos)
#define RSTC_RCAUSE_BODCORE_Msk (_U_(0x1) << RSTC_RCAUSE_BODCORE_Pos)
#define RSTC_RCAUSE_BODVDD_Msk (_U_(0x1) << RSTC_RCAUSE_BODVDD_Pos)
#define RSTC_RCAUSE_NVM_Msk (_U_(0x1) << RSTC_RCAUSE_NVM_Pos)
#define RSTC_RCAUSE_EXT_Msk (_U_(0x1) << RSTC_RCAUSE_EXT_Pos)
#define RSTC_RCAUSE_WDT_Msk (_U_(0x1) << RSTC_RCAUSE_WDT_Pos)
#define RSTC_RCAUSE_SYST_Msk (_U_(0x1) << RSTC_RCAUSE_SYST_Pos)
#define RSTC_RCAUSE_BACKUP_Msk (_U_(0x1) << RSTC_RCAUSE_BACKUP_Pos)
#define RSTC_BKUPEXIT_RTC_Msk (_U_(0x1) << RSTC_BKUPEXIT_RTC_Pos)
#define RSTC_BKUPEXIT_BBPS_Msk (_U_(0x1) << RSTC_BKUPEXIT_BBPS_Pos)
#define RSTC_BKUPEXIT_HIB_Msk (_U_(0x1) << RSTC_BKUPEXIT_HIB_Pos)
#define RSTC_RCAUSE_Msk RSTC_RCAUSE_MASK
#define RSTC_BKUPEXIT_Msk RSTC_BKUPEXIT_MASK
#define SDHC_TMR_DMAEN_Msk (_U_(0x1) << SDHC_TMR_DMAEN_Pos)
#define SDHC_TMR_BCEN_Msk (_U_(0x1) << SDHC_TMR_BCEN_Pos)
#define SDHC_TMR_DTDSEL_Msk (_U_(0x1) << SDHC_TMR_DTDSEL_Pos)
#define SDHC_TMR_MSBSEL_Msk (_U_(0x1) << SDHC_TMR_MSBSEL_Pos)
#define SDHC_CR_CMDCCEN_Msk (_U_(0x1) << SDHC_CR_CMDCCEN_Pos)
#define SDHC_CR_CMDICEN_Msk (_U_(0x1) << SDHC_CR_CMDICEN_Pos)
#define SDHC_CR_DPSEL_Msk (_U_(0x1) << SDHC_CR_DPSEL_Pos)
#define SDHC_PSR_CMDINHC_Msk (_U_(0x1) << SDHC_PSR_CMDINHC_Pos)
#define SDHC_PSR_CMDINHD_Msk (_U_(0x1) << SDHC_PSR_CMDINHD_Pos)
#define SDHC_PSR_DLACT_Msk (_U_(0x1) << SDHC_PSR_DLACT_Pos)
#define SDHC_PSR_RTREQ_Msk (_U_(0x1) << SDHC_PSR_RTREQ_Pos)
#define SDHC_PSR_WTACT_Msk (_U_(0x1) << SDHC_PSR_WTACT_Pos)
#define SDHC_PSR_RTACT_Msk (_U_(0x1) << SDHC_PSR_RTACT_Pos)
#define SDHC_PSR_BUFWREN_Msk (_U_(0x1) << SDHC_PSR_BUFWREN_Pos)
#define SDHC_PSR_BUFRDEN_Msk (_U_(0x1) << SDHC_PSR_BUFRDEN_Pos)
#define SDHC_PSR_CARDINS_Msk (_U_(0x1) << SDHC_PSR_CARDINS_Pos)
#define SDHC_PSR_CARDSS_Msk (_U_(0x1) << SDHC_PSR_CARDSS_Pos)
#define SDHC_PSR_CARDDPL_Msk (_U_(0x1) << SDHC_PSR_CARDDPL_Pos)
#define SDHC_PSR_WRPPL_Msk (_U_(0x1) << SDHC_PSR_WRPPL_Pos)
#define SDHC_PSR_CMDLL_Msk (_U_(0x1) << SDHC_PSR_CMDLL_Pos)
#define SDHC_HC1R_LEDCTRL_Msk (_U_(0x1) << SDHC_HC1R_LEDCTRL_Pos)
#define SDHC_HC1R_DW_Msk (_U_(0x1) << SDHC_HC1R_DW_Pos)
#define SDHC_HC1R_HSEN_Msk (_U_(0x1) << SDHC_HC1R_HSEN_Pos)
#define SDHC_HC1R_CARDDTL_Msk (_U_(0x1) << SDHC_HC1R_CARDDTL_Pos)
#define SDHC_HC1R_CARDDSEL_Msk (_U_(0x1) << SDHC_HC1R_CARDDSEL_Pos)
#define SDHC_HC1R_EMMC_DW_Msk (_U_(0x1) << SDHC_HC1R_EMMC_DW_Pos)
#define SDHC_HC1R_EMMC_HSEN_Msk (_U_(0x1) << SDHC_HC1R_EMMC_HSEN_Pos)
#define SDHC_PCR_SDBPWR_Msk (_U_(0x1) << SDHC_PCR_SDBPWR_Pos)
#define SDHC_BGCR_STPBGR_Msk (_U_(0x1) << SDHC_BGCR_STPBGR_Pos)
#define SDHC_BGCR_CONTR_Msk (_U_(0x1) << SDHC_BGCR_CONTR_Pos)
#define SDHC_BGCR_RWCTRL_Msk (_U_(0x1) << SDHC_BGCR_RWCTRL_Pos)
#define SDHC_BGCR_INTBG_Msk (_U_(0x1) << SDHC_BGCR_INTBG_Pos)
#define SDHC_BGCR_EMMC_STPBGR_Msk (_U_(0x1) << SDHC_BGCR_EMMC_STPBGR_Pos)
#define SDHC_BGCR_EMMC_CONTR_Msk (_U_(0x1) << SDHC_BGCR_EMMC_CONTR_Pos)
#define SDHC_WCR_WKENCINT_Msk (_U_(0x1) << SDHC_WCR_WKENCINT_Pos)
#define SDHC_WCR_WKENCINS_Msk (_U_(0x1) << SDHC_WCR_WKENCINS_Pos)
#define SDHC_WCR_WKENCREM_Msk (_U_(0x1) << SDHC_WCR_WKENCREM_Pos)
#define SDHC_CCR_INTCLKEN_Msk (_U_(0x1) << SDHC_CCR_INTCLKEN_Pos)
#define SDHC_CCR_INTCLKS_Msk (_U_(0x1) << SDHC_CCR_INTCLKS_Pos)
#define SDHC_CCR_SDCLKEN_Msk (_U_(0x1) << SDHC_CCR_SDCLKEN_Pos)
#define SDHC_CCR_CLKGSEL_Msk (_U_(0x1) << SDHC_CCR_CLKGSEL_Pos)
#define SDHC_SRR_SWRSTALL_Msk (_U_(0x1) << SDHC_SRR_SWRSTALL_Pos)
#define SDHC_SRR_SWRSTCMD_Msk (_U_(0x1) << SDHC_SRR_SWRSTCMD_Pos)
#define SDHC_SRR_SWRSTDAT_Msk (_U_(0x1) << SDHC_SRR_SWRSTDAT_Pos)
#define SDHC_NISTR_CMDC_Msk (_U_(0x1) << SDHC_NISTR_CMDC_Pos)
#define SDHC_NISTR_TRFC_Msk (_U_(0x1) << SDHC_NISTR_TRFC_Pos)
#define SDHC_NISTR_BLKGE_Msk (_U_(0x1) << SDHC_NISTR_BLKGE_Pos)
#define SDHC_NISTR_DMAINT_Msk (_U_(0x1) << SDHC_NISTR_DMAINT_Pos)
#define SDHC_NISTR_BWRRDY_Msk (_U_(0x1) << SDHC_NISTR_BWRRDY_Pos)
#define SDHC_NISTR_BRDRDY_Msk (_U_(0x1) << SDHC_NISTR_BRDRDY_Pos)
#define SDHC_NISTR_CINS_Msk (_U_(0x1) << SDHC_NISTR_CINS_Pos)
#define SDHC_NISTR_CREM_Msk (_U_(0x1) << SDHC_NISTR_CREM_Pos)
