dylad/RIOT/cpu/sam0_common/include/vendor/samd51/include/compat_samd51.h
#define USB_DEVICE_EPINTENSET_TRFAIL0_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_TRFAIL0_Pos)
#define USB_DEVICE_EPINTENSET_TRFAIL1_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_TRFAIL1_Pos)
#define USB_DEVICE_EPINTENSET_RXSTP_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_RXSTP_Pos)
#define USB_DEVICE_EPINTENSET_STALL0_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_STALL0_Pos)
#define USB_DEVICE_EPINTENSET_STALL1_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_STALL1_Pos)
#define USB_HOST_PINTENSET_TRCPT0_Msk (_U_(0x1) << USB_HOST_PINTENSET_TRCPT0_Pos)
#define USB_HOST_PINTENSET_TRCPT1_Msk (_U_(0x1) << USB_HOST_PINTENSET_TRCPT1_Pos)
#define USB_HOST_PINTENSET_TRFAIL_Msk (_U_(0x1) << USB_HOST_PINTENSET_TRFAIL_Pos)
#define USB_HOST_PINTENSET_PERR_Msk (_U_(0x1) << USB_HOST_PINTENSET_PERR_Pos)
#define USB_HOST_PINTENSET_TXSTP_Msk (_U_(0x1) << USB_HOST_PINTENSET_TXSTP_Pos)
#define USB_HOST_PINTENSET_STALL_Msk (_U_(0x1) << USB_HOST_PINTENSET_STALL_Pos)
#define USB_DEVICE_PCKSIZE_AUTO_ZLP_Msk (_U_(0x1) << USB_DEVICE_PCKSIZE_AUTO_ZLP_Pos)
#define USB_HOST_PCKSIZE_AUTO_ZLP_Msk (_U_(0x1) << USB_HOST_PCKSIZE_AUTO_ZLP_Pos)
#define USB_DEVICE_STATUS_BK_CRCERR_Msk (_U_(0x1) << USB_DEVICE_STATUS_BK_CRCERR_Pos)
#define USB_DEVICE_STATUS_BK_ERRORFLOW_Msk (_U_(0x1) << USB_DEVICE_STATUS_BK_ERRORFLOW_Pos)
#define USB_HOST_STATUS_BK_CRCERR_Msk (_U_(0x1) << USB_HOST_STATUS_BK_CRCERR_Pos)
#define USB_HOST_STATUS_BK_ERRORFLOW_Msk (_U_(0x1) << USB_HOST_STATUS_BK_ERRORFLOW_Pos)
#define USB_HOST_STATUS_PIPE_DTGLER_Msk (_U_(0x1) << USB_HOST_STATUS_PIPE_DTGLER_Pos)
#define USB_HOST_STATUS_PIPE_DAPIDER_Msk (_U_(0x1) << USB_HOST_STATUS_PIPE_DAPIDER_Pos)
#define USB_HOST_STATUS_PIPE_PIDER_Msk (_U_(0x1) << USB_HOST_STATUS_PIPE_PIDER_Pos)
#define USB_HOST_STATUS_PIPE_TOUTER_Msk (_U_(0x1) << USB_HOST_STATUS_PIPE_TOUTER_Pos)
#define USB_HOST_STATUS_PIPE_CRC16ER_Msk (_U_(0x1) << USB_HOST_STATUS_PIPE_CRC16ER_Pos)
#define USB_CTRLA_Msk USB_CTRLA_MASK
#define USB_SYNCBUSY_Msk USB_SYNCBUSY_MASK
#define USB_QOSCTRL_Msk USB_QOSCTRL_MASK
#define USB_DEVICE_CTRLB_Msk USB_DEVICE_CTRLB_MASK
#define USB_HOST_CTRLB_Msk USB_HOST_CTRLB_MASK
#define USB_DEVICE_DADD_Msk USB_DEVICE_DADD_MASK
#define USB_HOST_HSOFC_Msk USB_HOST_HSOFC_MASK
#define USB_DEVICE_STATUS_Msk USB_DEVICE_STATUS_MASK
#define USB_HOST_STATUS_Msk USB_HOST_STATUS_MASK
#define USB_FSMSTATUS_Msk USB_FSMSTATUS_MASK
#define USB_DEVICE_FNUM_Msk USB_DEVICE_FNUM_MASK
#define USB_HOST_FNUM_Msk USB_HOST_FNUM_MASK
#define USB_HOST_FLENHIGH_Msk USB_HOST_FLENHIGH_MASK
#define USB_DEVICE_INTENCLR_Msk USB_DEVICE_INTENCLR_MASK
#define USB_HOST_INTENCLR_Msk USB_HOST_INTENCLR_MASK
#define USB_DEVICE_INTENSET_Msk USB_DEVICE_INTENSET_MASK
#define USB_HOST_INTENSET_Msk USB_HOST_INTENSET_MASK
#define USB_DEVICE_INTFLAG_Msk USB_DEVICE_INTFLAG_MASK
#define USB_HOST_INTFLAG_Msk USB_HOST_INTFLAG_MASK
#define USB_DEVICE_EPINTSMRY_Msk USB_DEVICE_EPINTSMRY_MASK
#define USB_HOST_PINTSMRY_Msk USB_HOST_PINTSMRY_MASK
#define USB_DESCADD_Msk USB_DESCADD_MASK
#define USB_PADCAL_Msk USB_PADCAL_MASK
#define USB_DEVICE_EPCFG_Msk USB_DEVICE_EPCFG_MASK
#define USB_HOST_PCFG_Msk USB_HOST_PCFG_MASK
#define USB_HOST_BINTERVAL_Msk USB_HOST_BINTERVAL_MASK
#define USB_DEVICE_EPSTATUSCLR_Msk USB_DEVICE_EPSTATUSCLR_MASK
#define USB_HOST_PSTATUSCLR_Msk USB_HOST_PSTATUSCLR_MASK
#define USB_DEVICE_EPSTATUSSET_Msk USB_DEVICE_EPSTATUSSET_MASK
#define USB_HOST_PSTATUSSET_Msk USB_HOST_PSTATUSSET_MASK
#define USB_DEVICE_EPSTATUS_Msk USB_DEVICE_EPSTATUS_MASK
#define USB_HOST_PSTATUS_Msk USB_HOST_PSTATUS_MASK
#define USB_DEVICE_EPINTFLAG_Msk USB_DEVICE_EPINTFLAG_MASK
#define USB_HOST_PINTFLAG_Msk USB_HOST_PINTFLAG_MASK
#define USB_DEVICE_EPINTENCLR_Msk USB_DEVICE_EPINTENCLR_MASK
#define USB_HOST_PINTENCLR_Msk USB_HOST_PINTENCLR_MASK
#define USB_DEVICE_EPINTENSET_Msk USB_DEVICE_EPINTENSET_MASK
#define USB_HOST_PINTENSET_Msk USB_HOST_PINTENSET_MASK
#define USB_DEVICE_ADDR_Msk USB_DEVICE_ADDR_MASK
#define USB_HOST_ADDR_Msk USB_HOST_ADDR_MASK
#define USB_DEVICE_PCKSIZE_Msk USB_DEVICE_PCKSIZE_MASK
#define USB_HOST_PCKSIZE_Msk USB_HOST_PCKSIZE_MASK
#define USB_DEVICE_EXTREG_Msk USB_DEVICE_EXTREG_MASK
#define USB_HOST_EXTREG_Msk USB_HOST_EXTREG_MASK
#define USB_DEVICE_STATUS_BK_Msk USB_DEVICE_STATUS_BK_MASK
#define USB_HOST_STATUS_BK_Msk USB_HOST_STATUS_BK_MASK
#define USB_HOST_CTRL_PIPE_Msk USB_HOST_CTRL_PIPE_MASK
#define USB_HOST_STATUS_PIPE_Msk USB_HOST_STATUS_PIPE_MASK
#define WDT_CTRLA_ENABLE_Msk (_U_(0x1) << WDT_CTRLA_ENABLE_Pos)
#define WDT_CTRLA_WEN_Msk (_U_(0x1) << WDT_CTRLA_WEN_Pos)
#define WDT_CTRLA_ALWAYSON_Msk (_U_(0x1) << WDT_CTRLA_ALWAYSON_Pos)
#define WDT_INTENCLR_EW_Msk (_U_(0x1) << WDT_INTENCLR_EW_Pos)
#define WDT_INTENSET_EW_Msk (_U_(0x1) << WDT_INTENSET_EW_Pos)
#define WDT_INTFLAG_EW_Msk (_U_(0x1) << WDT_INTFLAG_EW_Pos)
#define WDT_SYNCBUSY_ENABLE_Msk (_U_(0x1) << WDT_SYNCBUSY_ENABLE_Pos)
#define WDT_SYNCBUSY_WEN_Msk (_U_(0x1) << WDT_SYNCBUSY_WEN_Pos)
#define WDT_SYNCBUSY_ALWAYSON_Msk (_U_(0x1) << WDT_SYNCBUSY_ALWAYSON_Pos)
#define WDT_SYNCBUSY_CLEAR_Msk (_U_(0x1) << WDT_SYNCBUSY_CLEAR_Pos)
#define WDT_CTRLA_Msk WDT_CTRLA_MASK
#define WDT_CONFIG_Msk WDT_CONFIG_MASK
#define WDT_EWCTRL_Msk WDT_EWCTRL_MASK
#define WDT_INTENCLR_Msk WDT_INTENCLR_MASK
#define WDT_INTENSET_Msk WDT_INTENSET_MASK
#define WDT_INTFLAG_Msk WDT_INTFLAG_MASK
#define WDT_SYNCBUSY_Msk WDT_SYNCBUSY_MASK
#define WDT_CLEAR_Msk WDT_CLEAR_MASK
#define REG_RTC_MODE2_ALARM_Msk REG_RTC_MODE2_ALARM_MASK

#ifdef __cplusplus
}
#endif

#endif
/** @} */
